 gcc -g p1original.c
 ./a.out
enter the height and base
1 2
the area of triangle with 1.000000 and height 2.000000 if is1.000000 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) bmain
Undefined command: "bmain".  Try "help".
(gdb) 
Undefined command: "bmain".  Try "help".
(gdb) b main
Breakpoint 1 at 0x81a: file p1original.c, line 17.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1original.c:17
17  {
(gdb) n
19    input(&a,&b);
(gdb) n
enter the height and base
1 2
20    find_area(a,b,&c);
(gdb) n
21    output(a,b,c);
(gdb) n
22    return 0;
(gdb) c
Continuing.
the area of triangle with 1.000000 and height 2.000000 if is1.000000[Inferior 1 (process 262) exited normally]
(gdb) 
